#include "../../hdr/generic.h"
#include "../../hdr/built_in_library.h"



void print_function(StockInfo *structptr) {
	int i;
	printf("===================================================================================================================================================================================\n");
	printf("종목코드             종목명               날짜                 종가                 전일비               시가                 고가                 저가                 거래량       \n");
	printf("===================================================================================================================================================================================\n");
	
	// 나중에는 실제 날짜를 넣을 것이지만, 현재느 최신 데이터가 30일 것이기 때문에
	char checkDate[11] = "2023.03.30";

	for (i = 0; i < 400; i++)
	{
		if (!strcmp(structptr[i].date, checkDate)) {
			printf("%-20s %-20s %-20s %-20d %-20d %-20d %-20d %-20d %-20d\n",
			structptr[i].stock_code,
			structptr[i].stock_name,
			structptr[i].date,
			structptr[i].close,
			structptr[i].compare,
			structptr[i].open,
			structptr[i].high,
			structptr[i].low,
			structptr[i].volume);
		}
	}
	printf("===================================================================================================================================================================================\n");
}